Tekla Open API Reference for Tekla Structures 2025
Parallel.LineToLine Method
Overload List
Name | Description
LineToLine(Line, Line)
 Returns true if the given lines are parallel.
LineToLine(Line, Line, Double)
 Returns true if the given lines are parallel within the given angular tolerance.
Top
See Also
Reference
Parallel Class
Tekla.Structures.Geometry3d Namespace